{
  "title": "Azure Cosmos DB Learning Journey",
  "subtitle": "An Interactive Visual Storybook",
  "chapters": [
    {
      "id": "overview",
      "title": "Getting Started with Azure Cosmos DB",
      "icon": "🌐",
      "color": "#0078D4",
      "sections": [
        {
          "id": "cosmos-overview",
          "title": "What is Azure Cosmos DB?",
          "image": "assets/images/overview/cosmosdb-overview.jpg",
          "description": "Azure Cosmos DB is Microsoft's globally distributed, multi-model database service designed for building highly responsive and scalable applications. It offers turnkey global distribution across any number of Azure regions with transparent multi-master replication. With industry-leading comprehensive SLAs covering throughput, consistency, availability, and latency, Cosmos DB ensures your applications perform optimally at any scale.",
          "keyPoints": [
            "Global distribution with multi-region writes",
            "Single-digit millisecond response times",
            "Five well-defined consistency models",
            "Comprehensive SLAs for availability and performance",
            "Multi-model support (Document, Key-Value, Graph, Column-family)"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/introduction"
        },
        {
          "id": "choose-api",
          "title": "Choosing the Right API",
          "image": "assets/images/overview/cosmosdb-choose-api.jpg",
          "description": "Azure Cosmos DB provides multiple APIs to work with your data, allowing you to choose the best fit for your application needs. The NoSQL API offers native support for JSON documents with SQL-like queries. MongoDB API provides compatibility with existing MongoDB applications. Cassandra API enables you to use Cosmos DB as a drop-in replacement for Apache Cassandra. Gremlin API supports graph database scenarios, while Table API offers a premium alternative to Azure Table Storage.",
          "keyPoints": [
            "NoSQL API: Native JSON with SQL queries",
            "MongoDB API: Full MongoDB compatibility",
            "Cassandra API: Apache Cassandra workloads",
            "Gremlin API: Graph database operations",
            "Table API: Enhanced Azure Table Storage"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/choose-api"
        }
      ]
    },
    {
      "id": "nosql",
      "title": "Azure Cosmos DB NoSQL API",
      "icon": "📄",
      "color": "#50E6FF",
      "sections": [
        {
          "id": "nosql-overview",
          "title": "NoSQL API Overview",
          "image": "assets/images/nosql/cosmosdb-nosql-overview.jpg",
          "description": "The NoSQL API in Azure Cosmos DB is designed for modern application development with native support for JSON documents. It provides a SQL-like query language that's familiar to developers while offering the flexibility and scale of a NoSQL database. The API supports automatic indexing of all properties, rich querying capabilities, and seamless integration with Azure services and popular development frameworks.",
          "keyPoints": [
            "Native JSON document storage",
            "SQL-like query syntax",
            "Automatic indexing of all properties",
            "Support for stored procedures, triggers, and UDFs",
            "Built-in support for hierarchical partition keys"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/"
        },
        {
          "id": "nosql-compare",
          "title": "Comparing NoSQL with Other Databases",
          "image": "assets/images/nosql/cosmosdb-nosql-compare.jpg",
          "description": "Understanding when to use Azure Cosmos DB NoSQL API versus traditional relational databases or other NoSQL solutions is crucial for application architecture. Cosmos DB excels in scenarios requiring global distribution, elastic scalability, and low-latency access to semi-structured or unstructured data. Unlike traditional SQL databases, it offers schema flexibility and horizontal scaling. Compared to other NoSQL databases, Cosmos DB provides comprehensive SLAs, turnkey global distribution, and multiple consistency models to choose from.",
          "keyPoints": [
            "Schema flexibility vs. rigid SQL schemas",
            "Horizontal scaling vs. vertical scaling",
            "Global distribution with multi-master writes",
            "Multiple consistency models for fine-grained control",
            "Comprehensive SLAs for enterprise workloads"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/compare"
        },
        {
          "id": "distributed-nosql",
          "title": "Understanding Distributed NoSQL",
          "image": "assets/images/nosql/cosmosdb-nosql-understand-distributed.jpg",
          "description": "Azure Cosmos DB's distributed architecture is fundamental to its ability to provide global scale and high availability. Data is automatically partitioned across multiple servers using partition keys, enabling horizontal scaling. The service replicates data across multiple Azure regions, ensuring low-latency access for users worldwide. With support for multi-region writes, applications can write data to the nearest region, reducing latency further. The system handles replica synchronization automatically while offering five consistency models to balance performance and data correctness.",
          "keyPoints": [
            "Automatic data partitioning for scale",
            "Multi-region replication for availability",
            "Multi-master writes for reduced latency",
            "Automatic failover and conflict resolution",
            "Transparent data synchronization across regions"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/distribute-data-globally"
        }
      ]
    },
    {
      "id": "ai",
      "title": "AI & Advanced Search Capabilities",
      "icon": "🤖",
      "color": "#8661C5",
      "sections": [
        {
          "id": "ai-why",
          "title": "Why Use Cosmos DB for AI Applications?",
          "image": "assets/images/ai/cosmosdb-nosql-ai-why.jpg",
          "description": "Azure Cosmos DB is uniquely positioned to serve as the database backbone for modern AI applications. Its ability to handle massive volumes of unstructured data with low latency makes it ideal for storing and retrieving embeddings, chat histories, and contextual information. The built-in vector search capabilities enable semantic similarity searches essential for RAG (Retrieval Augmented Generation) patterns. Combined with its global distribution and guaranteed performance SLAs, Cosmos DB ensures your AI applications remain responsive and available worldwide.",
          "keyPoints": [
            "Native vector search for embeddings",
            "Low-latency retrieval for real-time AI responses",
            "Global distribution for worldwide AI services",
            "Scalable storage for massive AI datasets",
            "Integration with Azure OpenAI and other AI services"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/vector-search"
        },
        {
          "id": "vector-search",
          "title": "Vector Search Capabilities",
          "image": "assets/images/ai/cosmosdb-nosql-ai-vector-search.jpg",
          "description": "Vector search in Azure Cosmos DB enables you to perform similarity searches on high-dimensional vector data, essential for AI and machine learning applications. You can store embeddings generated by models like Azure OpenAI directly alongside your business data, enabling powerful semantic search capabilities. The vector search uses advanced algorithms to quickly find the most similar vectors, making it perfect for recommendations, semantic search, image similarity, and other AI-driven features.",
          "keyPoints": [
            "Native support for vector embeddings",
            "Efficient similarity search algorithms",
            "Store vectors alongside business data",
            "Integration with Azure OpenAI embeddings",
            "Support for various distance metrics (cosine, euclidean, dot product)"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/vector-search"
        },
        {
          "id": "hybrid-search",
          "title": "Hybrid Search: Combining Vector and Traditional Search",
          "image": "assets/images/ai/cosmosdb-nosql-ai-hybrid-search.jpg",
          "description": "Hybrid search combines the semantic understanding of vector search with the precision of traditional keyword-based search. This powerful approach allows you to leverage both the contextual awareness of embeddings and the exact matching of traditional queries. In Cosmos DB, you can perform hybrid searches that find results matching specific keywords while also being semantically similar to your query, providing more relevant and comprehensive search results for your users.",
          "keyPoints": [
            "Combines semantic and keyword search",
            "More accurate and relevant results",
            "Single query for both search types",
            "Customizable ranking and scoring",
            "Ideal for complex search scenarios"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/hybrid-search"
        },
        {
          "id": "full-text-search",
          "title": "Full-Text Search",
          "image": "assets/images/ai/cosmosdb-nosql-ai-full-text-search.jpg",
          "description": "Full-text search in Azure Cosmos DB enables sophisticated text-based querying capabilities, including fuzzy matching, linguistic processing, and relevance ranking. Unlike simple string matching, full-text search understands language nuances, handles typos, and ranks results by relevance. This makes it ideal for user-facing search features where users expect intelligent, Google-like search experiences that go beyond exact matches.",
          "keyPoints": [
            "Fuzzy matching for typo tolerance",
            "Linguistic analysis and stemming",
            "Relevance-based ranking",
            "Support for multiple languages",
            "Complex text query operators"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/full-text-search"
        },
        {
          "id": "semantic-reranker",
          "title": "Semantic Reranker",
          "image": "assets/images/ai/cosmosdb-nosql-ai-semantic-reranker.jpg",
          "description": "The semantic reranker enhances search results by applying AI-powered reranking based on semantic understanding of both the query and results. After an initial search retrieves candidate results, the semantic reranker uses machine learning models to reorder them based on true semantic relevance rather than just keyword matching or vector similarity alone. This provides more accurate results that better match user intent, significantly improving the search experience.",
          "keyPoints": [
            "AI-powered result reranking",
            "Improves search relevance",
            "Understands query intent",
            "Works with existing search results",
            "Reduces irrelevant results"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/semantic-reranker"
        },
        {
          "id": "diskann",
          "title": "DiskANN for Efficient Vector Search",
          "image": "assets/images/ai/cosmosdb-nosql-ai-diskann.jpg",
          "description": "DiskANN (Disk-based Approximate Nearest Neighbor) is an advanced indexing technique that enables efficient vector search at massive scale. Unlike in-memory vector indexes that are limited by RAM, DiskANN can handle billions of vectors by intelligently using disk storage while maintaining high query performance. This makes it possible to build large-scale AI applications with comprehensive vector search capabilities without prohibitive memory costs.",
          "keyPoints": [
            "Handles billions of vectors efficiently",
            "Disk-based for cost-effective scale",
            "Maintains low query latency",
            "Approximate nearest neighbor search",
            "Optimized for large-scale AI applications"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/vector-search"
        }
      ]
    },
    {
      "id": "quickstarts",
      "title": "Quick Start Guides",
      "icon": "🚀",
      "color": "#00C851",
      "sections": [
        {
          "id": "quickstart-dotnet",
          "title": ".NET Quickstart",
          "image": "assets/images/quickstarts/cosmosdb-nosql-quickstart-dotnet.jpg",
          "description": "Get started with Azure Cosmos DB using .NET and C#. This quickstart guide walks you through creating your first Cosmos DB account, database, and container using the Azure Cosmos DB .NET SDK. Learn how to perform CRUD operations, query data using LINQ or SQL syntax, and implement best practices for connection management and error handling. The .NET SDK provides strong typing, async/await support, and seamless integration with ASP.NET Core applications.",
          "keyPoints": [
            "Use the Microsoft.Azure.Cosmos NuGet package",
            "Create CosmosClient with singleton pattern",
            "Perform CRUD operations with strong typing",
            "Query data using LINQ or SQL",
            "Implement retry policies and error handling"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/quickstart-dotnet"
        },
        {
          "id": "quickstart-java",
          "title": "Java Quickstart",
          "image": "assets/images/quickstarts/cosmosdb-nosql-quickstart-java.jpg",
          "description": "Build your first Azure Cosmos DB application using Java. This guide demonstrates how to use the Azure Cosmos DB Java SDK v4 to connect to Cosmos DB, create resources, and perform database operations. Learn about async operations with reactor patterns, implementing efficient connection pooling, and handling partition keys effectively. The Java SDK provides excellent performance and is ideal for Spring Boot and enterprise Java applications.",
          "keyPoints": [
            "Use azure-cosmos dependency",
            "Leverage reactive programming patterns",
            "Implement connection pooling",
            "Handle partition keys efficiently",
            "Integration with Spring Data Cosmos"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/quickstart-java"
        },
        {
          "id": "quickstart-python",
          "title": "Python Quickstart",
          "image": "assets/images/quickstarts/cosmosdb-nosql-quickstart-python.jpg",
          "description": "Dive into Azure Cosmos DB with Python using the azure-cosmos SDK. This quickstart shows you how to connect to Cosmos DB, create databases and containers, and perform operations using Pythonic patterns. Perfect for data science workflows, machine learning pipelines, and web applications built with Flask or FastAPI. Learn how to handle asynchronous operations, implement proper error handling, and optimize your queries for performance.",
          "keyPoints": [
            "Install azure-cosmos package via pip",
            "Use async/await for better performance",
            "Work with JSON documents naturally",
            "Implement proper error handling",
            "Ideal for ML and data science workloads"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/quickstart-python"
        },
        {
          "id": "quickstart-javascript",
          "title": "JavaScript/Node.js Quickstart",
          "image": "assets/images/quickstarts/cosmosdb-nosql-quickstart-js.jpg",
          "description": "Start building with Azure Cosmos DB in JavaScript and Node.js. This guide covers using the @azure/cosmos npm package to create a connection, manage databases and containers, and perform CRUD operations. Learn how to leverage async/await patterns, handle promises effectively, and integrate Cosmos DB with Express.js or Next.js applications. The JavaScript SDK provides excellent TypeScript support and is perfect for full-stack JavaScript applications.",
          "keyPoints": [
            "Install @azure/cosmos via npm",
            "Use async/await for cleaner code",
            "Full TypeScript support available",
            "Integration with Node.js frameworks",
            "Efficient bulk operations support"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/quickstart-nodejs"
        },
        {
          "id": "quickstart-typescript",
          "title": "TypeScript Quickstart",
          "image": "assets/images/quickstarts/cosmosdb-nosql-quickstart-ts.jpg",
          "description": "Leverage TypeScript's strong typing with Azure Cosmos DB for type-safe database operations. This quickstart demonstrates how to use the @azure/cosmos SDK with TypeScript to build robust applications with compile-time type checking. Learn how to define interfaces for your documents, use generics for type-safe queries, and implement proper error handling with typed exceptions. Ideal for enterprise applications requiring strong type guarantees.",
          "keyPoints": [
            "Full TypeScript type definitions included",
            "Define interfaces for your documents",
            "Type-safe query operations",
            "Compile-time error detection",
            "Better IDE intellisense support"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/quickstart-nodejs"
        },
        {
          "id": "quickstart-go",
          "title": "Go Quickstart",
          "image": "assets/images/quickstarts/cosmosdb-nosql-quickstart-go.jpg",
          "description": "Build high-performance applications with Azure Cosmos DB and Go. This quickstart covers using the Azure SDK for Go to interact with Cosmos DB, leveraging Go's concurrency features for optimal performance. Learn how to handle contexts properly, implement retry logic, and use goroutines for concurrent operations. The Go SDK is perfect for microservices, CLI tools, and high-throughput applications where performance is critical.",
          "keyPoints": [
            "Use github.com/Azure/azure-sdk-for-go",
            "Leverage Go's concurrency features",
            "Proper context handling",
            "Efficient connection management",
            "Ideal for microservices and high-performance apps"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/quickstart-go"
        },
        {
          "id": "quickstart-rust",
          "title": "Rust Quickstart",
          "image": "assets/images/quickstarts/cosmosdb-nosql-quickstart-rust.jpg",
          "description": "Experience the power of Azure Cosmos DB with Rust's safety guarantees and performance. This guide shows you how to use the azure_data_cosmos crate to build memory-safe, high-performance applications. Learn about Rust's ownership model in the context of database operations, async/await patterns with tokio, and how to handle errors using Result types. Perfect for systems programming, performance-critical services, and applications requiring memory safety.",
          "keyPoints": [
            "Memory safety with Rust's ownership",
            "High-performance async operations",
            "Type-safe error handling with Result",
            "Zero-cost abstractions",
            "Ideal for systems programming"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/quickstart-rust"
        }
      ]
    },
    {
      "id": "core-concepts",
      "title": "Core Concepts & Architecture",
      "icon": "⚙️",
      "color": "#FF6B35",
      "sections": [
        {
          "id": "resource-model",
          "title": "Resource Model Overview",
          "image": "assets/images/core-concepts/resource-model-ovierview.jpg",
          "description": "Azure Cosmos DB's resource model is hierarchical, starting with the database account at the top level. Under each account, you can create multiple databases, and within each database, you can create containers. Containers are the fundamental unit of scalability and store your items (documents). This clear hierarchy allows for organized data management and efficient resource allocation across your applications.",
          "keyPoints": [
            "Hierarchical structure: Account → Database → Container → Items",
            "Containers are the unit of scale and throughput",
            "Items are JSON documents stored in containers",
            "Built-in partitioning at the container level",
            "Independent scaling for each container"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/resource-model"
        },
        {
          "id": "request-units",
          "title": "Understanding Request Units (RUs)",
          "image": "assets/images/core-concepts/request-units.jpg",
          "description": "Request Units (RUs) are the currency of throughput in Azure Cosmos DB. They represent a normalized measure of computational resources required to perform database operations. A simple read of a 1KB document costs 1 RU, while writes and queries consume more based on complexity. Understanding RUs helps you provision the right amount of throughput and optimize costs for your workload.",
          "keyPoints": [
            "Normalized measure of compute, memory, and IOPS",
            "1 RU = cost to read 1KB item by ID",
            "Writes and complex queries cost more RUs",
            "Provision RUs at container or database level",
            "Monitor and optimize RU consumption"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/request-units"
        },
        {
          "id": "consistency-levels",
          "title": "Consistency Levels",
          "image": "assets/images/core-concepts/consistency-levels.jpg",
          "description": "Azure Cosmos DB offers five well-defined consistency levels that provide a spectrum of choices between strong consistency and eventual consistency. Choose Strong for linearizability, Bounded Staleness for consistent prefix with bounded lag, Session for consistent reads within a session, Consistent Prefix for order-preserving reads, or Eventual for maximum availability and lowest latency. Each level provides different trade-offs between consistency, availability, latency, and throughput.",
          "keyPoints": [
            "Strong: Linearizability guarantee",
            "Bounded Staleness: Consistent with bounded lag",
            "Session: Consistent within client session",
            "Consistent Prefix: Reads never see out-of-order writes",
            "Eventual: Highest availability and performance"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/consistency-levels"
        },
        {
          "id": "data-modeling",
          "title": "Data Modeling Best Practices",
          "image": "assets/images/core-concepts/data-modelling.jpg",
          "description": "Effective data modeling in Cosmos DB requires thinking differently than in relational databases. Design your data model around your access patterns and queries. Consider denormalization to reduce cross-partition queries, use composite keys for complex scenarios, and leverage hierarchical partition keys for better distribution. Proper modeling ensures optimal performance, cost-efficiency, and scalability for your applications.",
          "keyPoints": [
            "Model data based on access patterns",
            "Denormalize for query efficiency",
            "Use hierarchical partition keys",
            "Minimize cross-partition queries",
            "Balance between normalization and performance"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/modeling-data"
        },
        {
          "id": "provisioned-throughput-container",
          "title": "Provisioned Throughput (Container Level)",
          "image": "assets/images/core-concepts/provisioned-throughput-container.jpg",
          "description": "Provisioning throughput at the container level provides dedicated RU/s exclusively for that container. This approach is ideal when you have containers with predictable workloads or varying throughput requirements. Each container gets its allocated throughput, ensuring performance isolation and preventing noisy neighbor issues between containers.",
          "keyPoints": [
            "Dedicated RU/s per container",
            "Performance isolation between containers",
            "Ideal for predictable workloads",
            "Can be scaled independently",
            "Minimum 400 RU/s per container"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/set-throughput"
        },
        {
          "id": "provisioned-throughput-database",
          "title": "Provisioned Throughput (Database Level)",
          "image": "assets/images/core-concepts/provisioned-throughput-database.jpg",
          "description": "Database-level provisioned throughput allows you to share RU/s across multiple containers within a database. This is cost-effective when you have many containers with varying and unpredictable traffic patterns. Containers within the database share the allocated throughput, with automatic load balancing handled by Cosmos DB.",
          "keyPoints": [
            "Shared RU/s across containers",
            "Cost-effective for multiple containers",
            "Automatic load balancing",
            "Supports up to 25 containers",
            "Minimum 400 RU/s for the database"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/set-throughput"
        },
        {
          "id": "autoscale-throughput",
          "title": "Autoscale Throughput",
          "image": "assets/images/core-concepts/autoscale-throughput.jpg",
          "description": "Autoscale automatically adjusts your provisioned throughput based on actual usage, scaling between 10% of your maximum RU/s and your specified maximum. This eliminates the need for manual capacity planning and ensures you only pay for the throughput you use. Perfect for workloads with variable or unpredictable traffic patterns.",
          "keyPoints": [
            "Automatic scaling based on usage",
            "Scales from 10% to 100% of max RU/s",
            "Pay only for actual usage",
            "Instant scaling with no downtime",
            "Ideal for variable workloads"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/provision-throughput-autoscale"
        },
        {
          "id": "serverless",
          "title": "Serverless Mode",
          "image": "assets/images/core-concepts/serverless.jpg",
          "description": "Serverless mode offers a consumption-based pricing model where you only pay for the RUs consumed by your operations, with no provisioned throughput required. This is ideal for development, testing, and workloads with intermittent or unpredictable traffic. Serverless eliminates capacity planning and is perfect for getting started quickly or building event-driven applications.",
          "keyPoints": [
            "Pay only for RUs consumed",
            "No capacity planning required",
            "Ideal for dev/test and intermittent workloads",
            "Automatic scaling on demand",
            "No minimum throughput charges"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/serverless"
        },
        {
          "id": "design-resiliency",
          "title": "Designing Resilient Applications",
          "image": "assets/images/core-concepts/design-resiliency-apps.jpg",
          "description": "Building resilient applications with Cosmos DB requires implementing proper retry logic, handling transient failures, and designing for regional failovers. Use the SDK's built-in retry policies, implement circuit breakers, and configure multi-region writes for automatic failover. Proper error handling and monitoring ensure your applications remain available even during regional outages.",
          "keyPoints": [
            "Implement retry logic for transient failures",
            "Use multi-region writes for high availability",
            "Configure automatic failover policies",
            "Monitor availability and latency metrics",
            "Design for graceful degradation"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/high-availability"
        },
        {
          "id": "design-multi-tenant",
          "title": "Designing Multi-Tenant Applications",
          "image": "assets/images/core-concepts/design-multi-tentant-apps.jpg",
          "description": "Multi-tenant applications in Cosmos DB require careful consideration of data isolation, performance, and cost allocation. Choose between database-per-tenant, container-per-tenant, or partition-per-tenant strategies based on your requirements. Use hierarchical partition keys to efficiently isolate tenant data while maintaining query performance and cost optimization.",
          "keyPoints": [
            "Multiple tenancy models available",
            "Use partition keys for tenant isolation",
            "Hierarchical keys for complex scenarios",
            "Balance between isolation and cost",
            "Monitor per-tenant metrics"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/nosql/multi-tenancy"
        }
      ]
    },
    {
      "id": "develop-apps",
      "title": "Develop Applications",
      "icon": "💻",
      "color": "#7C4DFF",
      "sections": [
        {
          "id": "change-feed",
          "title": "Change Feed",
          "image": "assets/images/develop-apps/cosmos-changefeed.jpg",
          "description": "Change Feed provides a persistent log of changes made to your Cosmos DB containers in the order they occur. This enables event-driven architectures, real-time analytics, and data synchronization scenarios. Use change feed to trigger Azure Functions, build materialized views, or replicate data to other systems. It's a powerful feature for building reactive applications.",
          "keyPoints": [
            "Persistent log of all changes",
            "Ordered by partition key",
            "Enables event-driven patterns",
            "Integration with Azure Functions",
            "Supports incremental processing"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/change-feed"
        },
        {
          "id": "global-secondary-indexes",
          "title": "Global Secondary Indexes",
          "image": "assets/images/develop-apps/global-secondary-indexes.jpg",
          "description": "Global secondary indexes in Cosmos DB automatically index all properties in your documents by default, enabling efficient queries without requiring schema definitions. You can customize indexing policies to exclude certain paths, include only specific properties, or configure different index types (range, spatial, composite) based on your query patterns. Proper indexing strategy balances query performance with write throughput and storage costs.",
          "keyPoints": [
            "Automatic indexing of all properties",
            "Customizable indexing policies",
            "Support for composite indexes",
            "Spatial and full-text indexes",
            "Optimize for query patterns"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/index-policy"
        },
        {
          "id": "cosmos-emulator",
          "title": "Cosmos DB Emulator",
          "image": "assets/images/develop-apps/cosmos-emulator.jpg",
          "description": "The Azure Cosmos DB Emulator provides a local environment that emulates the Cosmos DB service for development and testing purposes. It's free, runs on your local machine, and supports all Cosmos DB APIs. Use the emulator to develop and test your applications locally without creating a cloud instance, saving costs during development and enabling offline development.",
          "keyPoints": [
            "Free local development environment",
            "Supports all Cosmos DB APIs",
            "No Azure subscription required",
            "Includes data explorer UI",
            "Perfect for CI/CD pipelines"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/emulator"
        },
        {
          "id": "vscode-extension",
          "title": "VS Code Extension",
          "image": "assets/images/develop-apps/cosmos-vscode-extension.jpg",
          "description": "The Azure Cosmos DB extension for Visual Studio Code provides a rich development experience directly within your editor. Browse and manage your Cosmos DB accounts, create and query databases and containers, view and edit documents, and execute queries without leaving VS Code. The extension supports IntelliSense for queries, making development faster and more productive.",
          "keyPoints": [
            "Manage accounts and resources",
            "Query and edit documents",
            "IntelliSense for SQL queries",
            "Integrated with Azure services",
            "Supports all Cosmos DB APIs"
          ],
          "learnMoreUrl": "https://marketplace.visualstudio.com/items?itemName=ms-azuretools.vscode-cosmosdb"
        }
      ]
    },
    {
      "id": "security",
      "title": "Security & Compliance",
      "icon": "🔒",
      "color": "#FF5252",
      "sections": [
        {
          "id": "security-overview",
          "title": "Security Overview",
          "image": "assets/images/security/overview.jpg",
          "description": "Azure Cosmos DB provides enterprise-grade security features including encryption at rest and in transit, network isolation with VNet and private endpoints, role-based access control (RBAC), and compliance with major standards. All data is encrypted automatically with Microsoft-managed keys, with the option to bring your own keys. Regular security audits and certifications ensure Cosmos DB meets the strictest compliance requirements.",
          "keyPoints": [
            "Encryption at rest and in transit",
            "Network isolation with VNets",
            "Private endpoint support",
            "Compliance with major standards",
            "Automatic security updates"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/database-security"
        },
        {
          "id": "rbac",
          "title": "Role-Based Access Control (RBAC)",
          "image": "assets/images/security/user-rbac.jpg",
          "description": "Azure Cosmos DB supports Azure RBAC for fine-grained access control to your database resources. Assign built-in roles like Cosmos DB Account Reader, Data Contributor, or create custom roles with specific permissions. RBAC enables secure, auditable access management integrated with Azure Active Directory, eliminating the need to manage connection strings and keys directly.",
          "keyPoints": [
            "Integration with Azure AD",
            "Built-in and custom roles",
            "Fine-grained permissions",
            "Audit access with Azure Monitor",
            "No need to manage keys manually"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/role-based-access-control"
        },
        {
          "id": "key-rotation",
          "title": "Key Rotation",
          "image": "assets/images/security/key-rotation.jpg",
          "description": "Regular key rotation is a security best practice that Cosmos DB makes easy to implement. The service supports both primary and secondary keys, allowing you to rotate keys without application downtime. Update your applications to use the secondary key, rotate the primary key, then switch back. This ensures continuous availability while maintaining security compliance and protecting against key compromise.",
          "keyPoints": [
            "Primary and secondary keys available",
            "Zero-downtime rotation process",
            "Automated rotation with Azure Key Vault",
            "Compliance requirement support",
            "Audit key usage and changes"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/secure-access-to-data"
        },
        {
          "id": "data-masking",
          "title": "Dynamic Data Masking",
          "image": "assets/images/security/ddm.jpg",
          "description": "Dynamic data masking helps protect sensitive data by limiting exposure to non-privileged users. Configure masking rules to hide sensitive information like credit card numbers, email addresses, or personal identifiers in query results. The data remains unchanged in the database, but masked users see obfuscated values, helping you comply with privacy regulations while maintaining application functionality.",
          "keyPoints": [
            "Hide sensitive data from users",
            "No changes to stored data",
            "Built-in masking functions",
            "Custom masking rules",
            "Supports compliance requirements"
          ],
          "learnMoreUrl": "https://learn.microsoft.com/azure/cosmos-db/data-masking"
        }
      ]
    }
  ]
}
